# CurtainGridFaceCannotBeReparamForGridRotation Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..CurtainWallFailures..::..CurtainGridFaceCannotBeReparamForGridRotation Property
BuiltInFailures..::..CurtainWallFailures Class See Also
---
Curtain grids cannot be rotated exactly as requested. Push "Adjust Grids" to get the nearest valid rotation.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId CurtainGridFaceCannotBeReparamForGridRotation { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CurtainGridFaceCannotBeReparamForGridRotation As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ CurtainGridFaceCannotBeReparamForGridRotation {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..CurtainWallFailures Class
Autodesk.Revit.DB Namespace